# PANDAS

In [2]:
import numpy as np
import pandas as pd

In [3]:
pd.__version__

'1.4.2'

In [4]:
arr=np.random.standard_normal((10,5))
arr

array([[ 0.07740444,  1.08178562, -0.68269471,  0.46658464,  1.06426838],
       [ 0.07927051, -1.03527339, -0.93311135,  0.21859453,  1.84542066],
       [-0.50562543,  0.48233383,  1.58662818, -0.4059881 ,  0.15710258],
       [ 1.32312729, -0.85858348,  1.22424364, -0.49375694, -0.8547066 ],
       [ 0.88991142,  0.5080486 , -0.97393296, -0.04546359, -0.46591798],
       [ 0.35257313,  0.55067526, -2.17814208,  0.80911011,  0.61638131],
       [ 1.27219026, -0.66538288,  0.6648551 ,  0.94259863, -1.26096156],
       [ 0.79019641,  1.30006911, -0.24927382, -0.09301982,  1.0535933 ],
       [ 0.5392683 , -0.87584068,  0.65327256, -0.04005772,  0.11658345],
       [ 0.28179672,  0.33194457, -0.08278309,  0.8561097 ,  1.21836451]])

In [5]:
df=pd.DataFrame(arr)
df

          0         1         2         3         4
0  0.077404  1.081786 -0.682695  0.466585  1.064268
1  0.079271 -1.035273 -0.933111  0.218595  1.845421
2 -0.505625  0.482334  1.586628 -0.405988  0.157103
3  1.323127 -0.858583  1.224244 -0.493757 -0.854707
4  0.889911  0.508049 -0.973933 -0.045464 -0.465918
5  0.352573  0.550675 -2.178142  0.809110  0.616381
6  1.272190 -0.665383  0.664855  0.942599 -1.260962
7  0.790196  1.300069 -0.249274 -0.093020  1.053593
8  0.539268 -0.875841  0.653273 -0.040058  0.116583
9  0.281797  0.331945 -0.082783  0.856110  1.218365

In [6]:
df.head(2)

          0         1         2         3         4
0  0.077404  1.081786 -0.682695  0.466585  1.064268
1  0.079271 -1.035273 -0.933111  0.218595  1.845421

In [7]:
df.tail(3)

          0         1         2         3         4
7  0.790196  1.300069 -0.249274 -0.093020  1.053593
8  0.539268 -0.875841  0.653273 -0.040058  0.116583
9  0.281797  0.331945 -0.082783  0.856110  1.218365

In [8]:
print("changing column names")
cols='A B C D E'.split()
cols

changing column names

['A', 'B', 'C', 'D', 'E']

In [9]:
df.columns=cols
df

          A         B         C         D         E
0  0.077404  1.081786 -0.682695  0.466585  1.064268
1  0.079271 -1.035273 -0.933111  0.218595  1.845421
2 -0.505625  0.482334  1.586628 -0.405988  0.157103
3  1.323127 -0.858583  1.224244 -0.493757 -0.854707
4  0.889911  0.508049 -0.973933 -0.045464 -0.465918
5  0.352573  0.550675 -2.178142  0.809110  0.616381
6  1.272190 -0.665383  0.664855  0.942599 -1.260962
7  0.790196  1.300069 -0.249274 -0.093020  1.053593
8  0.539268 -0.875841  0.653273 -0.040058  0.116583
9  0.281797  0.331945 -0.082783  0.856110  1.218365

In [10]:
pd.options.display.max_rows=6
df

           A         B         C         D         E
0   0.077404  1.081786 -0.682695  0.466585  1.064268
1   0.079271 -1.035273 -0.933111  0.218595  1.845421
2  -0.505625  0.482334  1.586628 -0.405988  0.157103
..       ...       ...       ...       ...       ...
7   0.790196  1.300069 -0.249274 -0.093020  1.053593
8   0.539268 -0.875841  0.653273 -0.040058  0.116583
9   0.281797  0.331945 -0.082783  0.856110  1.218365

[10 rows x 5 columns]

In [11]:
print("Getting metadata")
df.info()

Getting metadata
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       10 non-null     float64
 1   B       10 non-null     float64
 2   C       10 non-null     float64
 3   D       10 non-null     float64
 4   E       10 non-null     float64
dtypes: float64(5)
memory usage: 528.0 bytes

In [12]:
index=pd.date_range('01/01/2022',periods=10)
index

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08',
               '2022-01-09', '2022-01-10'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df.set_index(index,inplace=True)
df

                   A         B         C         D         E
2022-01-01  0.077404  1.081786 -0.682695  0.466585  1.064268
2022-01-02  0.079271 -1.035273 -0.933111  0.218595  1.845421
2022-01-03 -0.505625  0.482334  1.586628 -0.405988  0.157103
...              ...       ...       ...       ...       ...
2022-01-08  0.790196  1.300069 -0.249274 -0.093020  1.053593
2022-01-09  0.539268 -0.875841  0.653273 -0.040058  0.116583
2022-01-10  0.281797  0.331945 -0.082783  0.856110  1.218365

[10 rows x 5 columns]

In [14]:
df[['A','C']]

                   A         C
2022-01-01  0.077404 -0.682695
2022-01-02  0.079271 -0.933111
2022-01-03 -0.505625  1.586628
...              ...       ...
2022-01-08  0.790196 -0.249274
2022-01-09  0.539268  0.653273
2022-01-10  0.281797 -0.082783

[10 rows x 2 columns]

In [16]:
df.iloc[0]

A    0.077404
B    1.081786
C   -0.682695
D    0.466585
E    1.064268
Name: 2022-01-01 00:00:00, dtype: float64

In [17]:
df.iloc[[0,3,4]]

                   A         B         C         D         E
2022-01-01  0.077404  1.081786 -0.682695  0.466585  1.064268
2022-01-04  1.323127 -0.858583  1.224244 -0.493757 -0.854707
2022-01-05  0.889911  0.508049 -0.973933 -0.045464 -0.465918

In [18]:
df.iloc[0,3]

0.46658463958851465

In [19]:
df.iloc[0,3:]

D    0.466585
E    1.064268
Name: 2022-01-01 00:00:00, dtype: float64

In [20]:
df.loc['2022-01-01']

A    0.077404
B    1.081786
C   -0.682695
D    0.466585
E    1.064268
Name: 2022-01-01 00:00:00, dtype: float64

In [21]:
df.loc['2022-01-01':'2022-01-04']

                   A         B         C         D         E
2022-01-01  0.077404  1.081786 -0.682695  0.466585  1.064268
2022-01-02  0.079271 -1.035273 -0.933111  0.218595  1.845421
2022-01-03 -0.505625  0.482334  1.586628 -0.405988  0.157103
2022-01-04  1.323127 -0.858583  1.224244 -0.493757 -0.854707

In [22]:
df<0

                A      B      C      D      E
2022-01-01  False  False   True  False  False
2022-01-02  False   True   True  False  False
2022-01-03   True  False  False   True  False
...           ...    ...    ...    ...    ...
2022-01-08  False  False   True   True  False
2022-01-09  False   True  False   True  False
2022-01-10  False  False   True  False  False

[10 rows x 5 columns]

In [24]:
mask=df<0
df[mask]=0
df

                   A         B         C         D         E
2022-01-01  0.077404  1.081786  0.000000  0.466585  1.064268
2022-01-02  0.079271  0.000000  0.000000  0.218595  1.845421
2022-01-03  0.000000  0.482334  1.586628  0.000000  0.157103
...              ...       ...       ...       ...       ...
2022-01-08  0.790196  1.300069  0.000000  0.000000  1.053593
2022-01-09  0.539268  0.000000  0.653273  0.000000  0.116583
2022-01-10  0.281797  0.331945  0.000000  0.856110  1.218365

[10 rows x 5 columns]

In [25]:
pd.DataFrame({'A':range(15),'B':range(16,31)})
df2=pd.DataFrame({'A':range(15),'B':range(16,31)})
df2

     A   B
0    0  16
1    1  17
2    2  18
..  ..  ..
12  12  28
13  13  29
14  14  30

[15 rows x 2 columns]

In [27]:
df2['C']=df2['B']**2
df2

     A   B    C
0    0  16  256
1    1  17  289
2    2  18  324
..  ..  ..  ...
12  12  28  784
13  13  29  841
14  14  30  900

[15 rows x 3 columns]

In [28]:
df2.describe()

               A          B           C
count  15.000000  15.000000   15.000000
mean    7.000000  23.000000  547.666667
std     4.472136   4.472136  206.433201
...          ...        ...         ...
50%     7.000000  23.000000  529.000000
75%    10.500000  26.500000  702.500000
max    14.000000  30.000000  900.000000

[8 rows x 3 columns]

In [29]:
df2['A'].describe()

count    15.000000
mean      7.000000
std       4.472136
           ...
50%       7.000000
75%      10.500000
max      14.000000
Name: A, Length: 8, dtype: float64

In [30]:
import numpy as np
import pandas as pd

In [32]:
data=pd.read_csv('test.csv')
data

  Name Marks
0    Amit 85
1    Aman 75
2    Ram  95

# Panda Excercise-1

Create a Dataframe as follows using Pandas

In [1]:
import pandas as pd
import numpy as np
marks={'Chemistry':[67,90,66,32],
      'Physics':[45,92,72,40],
      'Mathematics':[50,87,81,12],
      'English':[19,90,72,68]}
marks_df=pd.DataFrame(marks,index=['Subodh','Ram','Abdul','Jhon'])
marks_df

        Chemistry  Physics  Mathematics  English
Subodh         67       45           50       19
Ram            90       92           87       90
Abdul          66       72           81       72
Jhon           32       40           12       68

The teacher want to create a new column called total and the value of each row in total column should be the sum of all marks of each student

In [2]:
marks_df['Total']=marks_df['Chemistry']+marks_df['Physics']+marks_df['Mathematics']+marks_df['English']
marks_df

        Chemistry  Physics  Mathematics  English  Total
Subodh         67       45           50       19    181
Ram            90       92           87       90    359
Abdul          66       72           81       72    291
Jhon           32       40           12       68    152

Drop the Total column

In [3]:
marks_df.drop(columns='Total', inplace=True)
marks_df

        Chemistry  Physics  Mathematics  English
Subodh         67       45           50       19
Ram            90       92           87       90
Abdul          66       72           81       72
Jhon           32       40           12       68

The teacher wants to award five bonus marks to all the students

In [4]:
new_marks=marks_df+5
new_marks

        Chemistry  Physics  Mathematics  English
Subodh         72       50           55       24
Ram            95       97           92       95
Abdul          71       77           86       77
Jhon           37       45           17       73

The teacher wants to increase the marks of all the students as follows

In [5]:
new_marks=marks_df + [5,10,10,2]
new_marks

        Chemistry  Physics  Mathematics  English
Subodh         72       55           60       21
Ram            95      102           97       92
Abdul          71       82           91       74
Jhon           37       50           22       70

The teacher wants to get the total marks scored in each subject

In [6]:
marks_df.apply(np.sum,axis=0)

Chemistry      255
Physics        249
Mathematics    230
English        249
dtype: int64

 The teacher wants to get the total marks scored by each student

In [7]:
marks_df.apply(np.sum,axis=1)

Subodh    181
Ram       359
Abdul     291
Jhon      152
dtype: int64

The teacher wants to hide the marks of the students who scored less than 35 marks and display Fail in place of those marks

In [8]:
f=marks_df<35
marks_df.mask(f,'Fail')

       Chemistry  Physics Mathematics English
Subodh        67       45          50    Fail
Ram           90       92          87      90
Abdul         66       72          81      72
Jhon        Fail       40        Fail      68

# Pandas Excercise-2

Perform the following operation on Autompg.csv of XYZ Custom Cars
company using Pandas

In [18]:
import numpy as np
import pandas as pd

Read data from an existing file

In [22]:
import numpy as np
import pandas as pd
df=pd.read_csv('auto_mpg.csv')
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino